apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_touch_lowerhalf.h
static inline void touch_lh_start_fsm(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_TIMER_FORCE_DONE,
                TOUCH_LH_TIMER_FORCE_DONE);

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_TIMER_FORCE_DONE,
                TOUCH_LH_TIMER_DONE);

  bool reg_val = (touch_lh_get_fsm_mode() == TOUCH_FSM_MODE_TIMER) ? 1 : 0;

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_SLP_TIMER_EN,
                reg_val);
}

/****************************************************************************
 * Name: touch_lh_stop_fsm
 *
 * Description:
 *   Stop the internal touch finite state machine.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_stop_fsm(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_START_EN,
                false);

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_SLP_TIMER_EN,
                false);

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_TIMER_FORCE_DONE,
                TOUCH_LH_TIMER_FORCE_DONE);

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_TIMER_FORCE_DONE,
                TOUCH_LH_TIMER_DONE);
}

/****************************************************************************
 * Name: touch_lh_get_fsm_state
 *
 * Description:
 *   Get touch sensor FSM state.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   True if open, false if closed.
 *
 ****************************************************************************/

static inline bool touch_lh_get_fsm_state(void)
{
  return (bool) REG_GET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                              RTC_CNTL_TOUCH_SLP_TIMER_EN);
}

/****************************************************************************
 * Name: touch_lh_start_sw_meas
 *
 * Description:
 *   Start measurement controlled by software.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_start_sw_meas(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_START_EN,
                false);

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_START_EN,
                true);
}

/****************************************************************************
 * Name: touch_lh_set_threshold
 *
 * Description:
 *   Set the touch interrupt threshold for a given touch pad.
 *   The threshold determines the sensitivity of the touch sensor.
 *   The threshold is the original value of the trigger state minus the
 *   benchmark value.
 *   If set to "TOUCH_PAD_THRESHOLD_MAX", the touch is never be triggered.
 *
 * Input Parameters:
 *   tp - The touch pad channel;
 *   threshold - The desired threshold value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_threshold(enum touch_pad_e tp,
                                          uint32_t threshold)
{
  /* All touch pads have the same position for the threshold bits.
   * We can use any SENS_TOUCH_OUT_THN.
   */

  REG_SET_FIELD(sens_touch_thresh_reg[tp - 1],
                SENS_TOUCH_OUT_TH1,
                threshold);
}

/****************************************************************************
 * Name: touch_lh_get_threshold
 *
 * Description:
 *   Get the touch interrupt threshold for a given touch pad.
 *   The threshold determines the sensitivity of the touch sensor.
 *   The threshold is the original value of the trigger state minus the
 *   benchmark value.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The current interrupt threshold for that touch pad.
 *
 ****************************************************************************/

static inline uint16_t touch_lh_get_threshold(enum touch_pad_e tp)
{
  /* All touch pads have the same position for the threshold bits.
   * We can use any SENS_TOUCH_OUT_THN.
   */

  return REG_GET_FIELD(sens_touch_thresh_reg[tp - 1], SENS_TOUCH_OUT_TH1);
}

/****************************************************************************
 * Name: touch_lh_set_channel_mask
 *
 * Description:
 *   Enable touch channels to be measured.
 *
 * Input Parameters:
 *   enable_mask - Bitmask containing the desired channels to be activated.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_channel_mask(uint16_t enable_mask)
{
  setbits(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
          (enable_mask & ((1 << TOUCH_SENSOR_PINS) - 1)) <<
          RTC_CNTL_TOUCH_SCAN_PAD_MAP_S);

  setbits(SENS_SAR_TOUCH_CONF_REG,
          (enable_mask & ((1 << TOUCH_SENSOR_PINS) - 1)) <<
          SENS_TOUCH_OUTEN_S);
}

/****************************************************************************
 * Name: touch_lh_get_channel_mask
 *
 * Description:
 *   Get the active touch channels to be measured.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Bitmask of the current chennels being measured.
 *
 ****************************************************************************/

static inline uint16_t touch_lh_get_channel_mask(void)
{
  return (REG_GET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                        RTC_CNTL_TOUCH_SCAN_PAD_MAP) &
          REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                        SENS_TOUCH_OUTEN));
}

/****************************************************************************
 * Name: touch_lh_clear_channel_mask
 *
 * Description:
 *   Disable touch channels being measured.
 *
 * Input Parameters:
 *   disable_mask - Bitmask containing the desired channels to be disabled.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_clear_channel_mask(uint16_t disable_mask)
{
  resetbits(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
            (disable_mask & ((1 << TOUCH_SENSOR_PINS) - 1)) <<
            RTC_CNTL_TOUCH_SCAN_PAD_MAP_S);

  resetbits(SENS_SAR_TOUCH_CONF_REG,
            (disable_mask & ((1 << TOUCH_SENSOR_PINS) - 1)) <<
            SENS_TOUCH_OUTEN_S);
}

/****************************************************************************
 * Name: touch_lh_read_trigger_status_mask
 *
 * Description:
 *   Get the channels that triggered a touch interrupt.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Bitmask of the channels that triggered a touch interrupt.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_read_trigger_status_mask(void)
{
  return REG_GET_FIELD(SENS_SAR_TOUCH_CHN_ST_REG, SENS_TOUCH_PAD_ACTIVE);
}

/****************************************************************************
 * Name: touch_lh_clear_trigger_status_mask
 *
 * Description:
 *   Clear the touch interrupt channels bitmask.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_clear_trigger_status_mask(void)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG, SENS_TOUCH_STATUS_CLR, true);
}

/****************************************************************************
 * Name: touch_lh_read_raw_data
 *
 * Description:
 *   Get the measured value for a given touch pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The current measured value for that touch pad.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_read_raw_data(enum touch_pad_e tp)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_DATA_SEL,
                TOUCH_LH_READ_RAW);

