apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_touch_lowerhalf.h
  if (int_mask & TOUCH_INTR_MASK_ACTIVE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_RTC_W1TC_REG,
                    RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TC,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_INACTIVE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_RTC_W1TC_REG,
                    RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TC,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_SCAN_DONE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_RTC_W1TC_REG,
                    RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TC,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_TIMEOUT)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_RTC_W1TC_REG,
                    RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TC,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_PROXI_MEAS_DONE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_RTC_W1TC_REG,
                    RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC,
                    true);
    }
}

/****************************************************************************
 * Name: touch_lh_intr_clear
 *
 * Description:
 *   Clear touch sensor interrupt by bitmask.
 *
 * Input Parameters:
 *   int_mask - enum touch_pad_intr_mask_e interrupt type.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_intr_clear(enum touch_intr_mask_e int_mask)
{
  if (int_mask & TOUCH_INTR_MASK_DONE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_CLR_REG,
                    RTC_CNTL_TOUCH_DONE_INT_CLR,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_ACTIVE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_CLR_REG,
                    RTC_CNTL_TOUCH_ACTIVE_INT_CLR,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_INACTIVE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_CLR_REG,
                    RTC_CNTL_TOUCH_INACTIVE_INT_CLR,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_SCAN_DONE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_CLR_REG,
                    RTC_CNTL_TOUCH_SCAN_DONE_INT_CLR,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_TIMEOUT)
    {
      REG_SET_FIELD(RTC_CNTL_INT_CLR_REG,
                    RTC_CNTL_TOUCH_TIMEOUT_INT_CLR,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_PROXI_MEAS_DONE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_CLR_REG,
                    RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_CLR,
                    true);
    }
}

/****************************************************************************
 * Name: touch_lh_read_intr_status_mask
 *
 * Description:
 *   Get the bitmask of touch sensor interrupt status.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   enum touch_pad_intr_mask_e interrupt type.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_read_intr_status_mask(void)
{
  uint32_t intr_st = getreg32(RTC_CNTL_INT_ST_REG);
  uint32_t intr_msk = 0;

  if (intr_st & RTC_CNTL_TOUCH_DONE_INT_ST_M)
    {
      intr_msk |= TOUCH_INTR_MASK_DONE;
    }

  if (intr_st & RTC_CNTL_TOUCH_ACTIVE_INT_ST_M)
    {
      intr_msk |= TOUCH_INTR_MASK_ACTIVE;
    }

  if (intr_st & RTC_CNTL_TOUCH_INACTIVE_INT_ST_M)
    {
      intr_msk |= TOUCH_INTR_MASK_INACTIVE;
    }

  if (intr_st & RTC_CNTL_TOUCH_SCAN_DONE_INT_ST_M)
    {
      intr_msk |= TOUCH_INTR_MASK_SCAN_DONE;
    }

  if (intr_st & RTC_CNTL_TOUCH_TIMEOUT_INT_ST_M)
    {
      intr_msk |= TOUCH_INTR_MASK_TIMEOUT;
    }

  if (intr_st & RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ST_M)
    {
      intr_msk |= TOUCH_INTR_MASK_PROXI_MEAS_DONE;
    }

  return (intr_msk & TOUCH_INTR_MASK_ALL);
}

/****************************************************************************
 * Name: touch_lh_timeout_enable
 *
 * Description:
 *   Enable the timeout check for all touch sensor channels measurements.
 *   When the touch reading exceeds the measurement threshold,
 *   If enable: a timeout interrupt will be generated and it will go to the
 *   next channel measurement.
 *   If disable: the FSM is always on the channel, until the measurement of
 *   this channel is over.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_timeout_enable(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_TIMEOUT_CTRL_REG,
                RTC_CNTL_TOUCH_TIMEOUT_EN,
                true);
}

/****************************************************************************
 * Name: touch_lh_timeout_disable
 *
 * Description:
 *   Disable the timeout check for all touch sensor channels measurements.
 *   When the touch reading exceeds the measurement threshold,
 *   If enable: a timeout interrupt will be generated and it will go to the
 *   next channel measurement.
 *   If disable: the FSM is always on the channel, until the measurement of
 *   this channel is over.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_timeout_disable(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_TIMEOUT_CTRL_REG,
                RTC_CNTL_TOUCH_TIMEOUT_EN,
                false);
}

/****************************************************************************
 * Name: touch_lh_timeout_set_threshold
 *
 * Description:
 *   Set timeout threshold for all touch sensor channels measurements.
 *   Compared with touch readings.
 *
 * Input Parameters:
 *   threshold - The maximum time measured on one channel.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_timeout_set_threshold(uint32_t threshold)
{
  return REG_SET_FIELD(RTC_CNTL_TOUCH_TIMEOUT_CTRL_REG,
                       RTC_CNTL_TOUCH_TIMEOUT_NUM,
                       threshold);
}

/****************************************************************************
 * Name: touch_lh_timeout_get_threshold
 *
 * Description:
 *   Get timeout threshold for all touch sensor channels measurements.
 *   Compared with touch readings.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current maximum time measured on one channel.
 *
 ****************************************************************************/

