apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_touch_lowerhalf.h
static inline uint32_t touch_lh_timeout_get_threshold(void)
{
  return REG_GET_FIELD(RTC_CNTL_TOUCH_TIMEOUT_CTRL_REG,
                       RTC_CNTL_TOUCH_TIMEOUT_NUM);
}

/****************************************************************************
 * Name: touch_lh_filter_read_smooth
 *
 * Description:
 *   Get the smoothed measured value for a given touch pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The current filtered value for that touch pad.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_filter_read_smooth(enum touch_pad_e tp)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_DATA_SEL,
                TOUCH_LH_READ_SMOOTH);

  /* All touch pads have the same position for the data bits.
   * We can use any SENS_TOUCH_PADN_DATA.
   */

  return REG_GET_FIELD(sens_touch_status_reg[tp - 1],
                       SENS_TOUCH_PAD1_DATA);
}

/****************************************************************************
 * Name: touch_lh_read_benchmark
 *
 * Description:
 *   Get the benchmark value for a given touch pad.
 *   After initialization, the benchmark value is the maximum during the
 *   first measurement period.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The current benchmark value for that touch pad.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_read_benchmark(enum touch_pad_e tp)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_DATA_SEL,
                TOUCH_LH_READ_BENCHMARK);

  /* All touch pads have the same position for the data bits.
   * We can use any SENS_TOUCH_PADN_DATA.
   */

  return REG_GET_FIELD(sens_touch_status_reg[tp - 1],
                       SENS_TOUCH_PAD1_DATA);
}

/****************************************************************************
 * Name: touch_lh_reset_benchmark
 *
 * Description:
 *   Force reset benchmark to raw data of touch sensor.
 *   If call this API, make sure enable clock gate first.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_reset_benchmark(enum touch_pad_e tp)
{
  if (tp == TOUCH_PAD_ALL)
    {
      REG_SET_FIELD(SENS_SAR_TOUCH_CHN_ST_REG,
                    SENS_TOUCH_CHANNEL_CLR,
                    TOUCH_BIT_MASK_ALL);
    }
  else
    {
      REG_SET_FIELD(SENS_SAR_TOUCH_CHN_ST_REG,
                    SENS_TOUCH_CHANNEL_CLR,
                    (1U << tp));
    }
}

/****************************************************************************
 * Name: touch_lh_filter_set_filter_mode
 *
 * Description:
 *   Set filter mode. The input of the filter is the raw value of touch
 *   reading, and the output of the filter is involved in the judgment of the
 *   touch state.
 *
 * Input Parameters:
 *   mode - The desired enum touch_filter_mode_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void
  touch_lh_filter_set_filter_mode(enum touch_filter_mode_e mode)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_FILTER_MODE,
                mode);
}

/****************************************************************************
 * Name: touch_lh_filter_get_filter_mode
 *
 * Description:
 *   Get filter mode. The input of the filter is the raw value of touch
 *   reading, and the output of the filter is involved in the judgment of the
 *   touch state.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_filter_mode_e value.
 *
 ****************************************************************************/

static inline enum touch_filter_mode_e
  touch_lh_filter_get_filter_mode(void)
{
  return (enum touch_filter_mode_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                  RTC_CNTL_TOUCH_FILTER_MODE);
}

/****************************************************************************
 * Name: touch_lh_filter_set_smooth_mode
 *
 * Description:
 *   Set filter mode. The input to the filter is raw data and the output is
 *   the smooth data.
 *   The smooth data is used to determine the touch status.
 *
 * Input Parameters:
 *   mode - The desired enum touch_smooth_mode_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void
  touch_lh_filter_set_smooth_mode(enum touch_smooth_mode_e mode)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_SMOOTH_LVL,
                mode);
}

/****************************************************************************
 * Name: touch_lh_filter_get_smooth_mode
 *
 * Description:
 *   Set filter mode. The input to the filter is raw data and the output is
 *   the smooth data.
 *   The smooth data is used to determine the touch status.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_smooth_mode_e value.
 *
 ****************************************************************************/

static inline enum touch_smooth_mode_e
  touch_lh_filter_get_smooth_mode(void)
{
  return (enum touch_smooth_mode_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                  RTC_CNTL_TOUCH_SMOOTH_LVL);
}

/****************************************************************************
 * Name: touch_lh_filter_set_debounce
 *
 * Description:
 *   Set debounce count, such as `n`. If the measured values continue to
 *   exceed the threshold for `n+1` times, it is determined that the touch
 *   sensor state changes.
 *
 * Input Parameters:
 *   dbc_cnt - Debounce count value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_filter_set_debounce(uint32_t dbc_cnt)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_DEBOUNCE,
                dbc_cnt);
}

/****************************************************************************
 * Name: touch_lh_filter_get_debounce
 *
 * Description:
 *   Get debounce count, such as `n`. If the measured values continue to
 *   exceed the threshold for `n+1` times, it is determined that the touch
 *   sensor state changes.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current debounce count value.
 *
 ****************************************************************************/

