apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_touch_lowerhalf.h
static inline uint32_t touch_lh_filter_get_debounce(void)
{
  return REG_GET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                       RTC_CNTL_TOUCH_DEBOUNCE);
}

/****************************************************************************
 * Name: touch_lh_filter_set_noise_thres
 *
 * Description:
 *   Set noise threshold coefficient. Higher = More noise resistance.
 *   The actual noise should be less than (noise coefficient * touch
 *   threshold).
 *   Range: 0 ~ 3. The coefficient is 0: 4/8; 1: 3/8; 2: 2/8; 3: 1;
 *
 * Input Parameters:
 *   noise_thr - Noise threshold coefficient.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_filter_set_noise_thres(uint32_t noise_thr)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_NOISE_THRES,
                noise_thr);

  /* config2 in IDF */

  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_NEG_NOISE_THRES,
                noise_thr);

  /* config1 in IDF */

  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_NEG_NOISE_LIMIT,
                0xf);

  /* config3 in IDF */

  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_HYSTERESIS,
                2);
}

/****************************************************************************
 * Name: touch_lh_filter_get_noise_thres
 *
 * Description:
 *   Get noise threshold coefficient. Higher = More noise resistance.
 *   The actual noise should be less than (noise coefficient * touch
 *   threshold).
 *   Range: 0 ~ 3. The coefficient is 0: 4/8; 1: 3/8; 2: 2/8; 3: 1;
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current noise threshold coefficient.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_filter_get_noise_thres(void)
{
  return REG_GET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                       RTC_CNTL_TOUCH_NOISE_THRES);
}

/****************************************************************************
 * Name: touch_lh_filter_set_jitter_step
 *
 * Description:
 *   If filter mode is jitter, should set filter step for jitter.
 *   Range: 0 ~ 15
 *
 * Input Parameters:
 *   step - The step size of the data change.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_filter_set_jitter_step(uint32_t step)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_JITTER_STEP,
                step);
}

/****************************************************************************
 * Name: touch_lh_filter_get_jitter_step
 *
 * Description:
 *   If filter mode is jitter, should set filter step for jitter.
 *   Range: 0 ~ 15
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current step size of the data change.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_filter_get_jitter_step(void)
{
  return REG_GET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                       RTC_CNTL_TOUCH_JITTER_STEP);
}

/****************************************************************************
 * Name: touch_lh_filter_enable
 *
 * Description:
 *   Enable touch sensor filter and detection algorithm.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_filter_enable(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_FILTER_EN,
                true);
}

/****************************************************************************
 * Name: touch_lh_filter_disable
 *
 * Description:
 *   Disable touch sensor filter and detection algorithm.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_filter_disable(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_FILTER_EN,
                false);
}

/****************************************************************************
 * Name: touch_lh_denoise_enable
 *
 * Description:
 *   Enable denoise function.
 *   T0 is an internal channel that does not have a corresponding external
 *   GPIO.
 *   T0 will work simultaneously with the measured channel Tn. Finally, the
 *   actual measured value of Tn is the value after subtracting lower bits
 *   of T0.
 *   This denoise function filters out interference introduced on all
 *   channels, such as noise introduced by the power supply and external EMI.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_denoise_enable(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_DENOISE_EN,
                true);
}

/****************************************************************************
 * Name: touch_lh_denoise_disable
 *
 * Description:
 *   Disable denoise function.
 *   T0 is an internal channel that does not have a corresponding external
 *   GPIO.
 *   T0 will work simultaneously with the measured channel Tn. Finally, the
 *   actual measured value of Tn is the value after subtracting lower bits
 *   of T0.
 *   This denoise function filters out interference introduced on all
 *   channels, such as noise introduced by the power supply and external EMI.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_denoise_disable(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_FILTER_CTRL_REG,
                RTC_CNTL_TOUCH_DENOISE_EN,
                false);
}

/****************************************************************************
 * Name: touch_lh_denoise_set_cap_level
 *
 * Description:
 *   Set internal reference capacitance of denoise channel.
 *   Select the appropriate internal reference capacitance value so that the
 *   reading of denoise channel is closest to the reading of the channel
 *   being measured.
 *
 * Input Parameters:
 *   cap_level - The desired enum touch_pad_denoise_cap_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void
  touch_lh_denoise_set_cap_level(enum touch_denoise_cap_e cap_level)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_REFC,
                cap_level);
}

/****************************************************************************
 * Name: touch_lh_denoise_get_cap_level
 *
 * Description:
 *   Get internal reference capacitance of denoise channel.
 *   Select the appropriate internal reference capacitance value so that the
 *   reading of denoise channel is closest to the reading of the channel
 *   being measured.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_pad_denoise_cap_e value.
 *
 ****************************************************************************/

static inline enum touch_denoise_cap_e touch_lh_denoise_get_cap_level(void)
{
  return (enum touch_denoise_cap_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG, RTC_CNTL_TOUCH_REFC);
}

/****************************************************************************
 * Name: touch_lh_denoise_set_grade
 *
 * Description:
 *   Set denoise range of denoise channel.
 *   Determined by measuring the noise amplitude of the denoise channel.
 *
 * Input Parameters:
 *   grade - The desired enum touch_denoise_grade_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void
  touch_lh_denoise_set_grade(enum touch_denoise_grade_e grade)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                RTC_CNTL_TOUCH_DENOISE_RES,
                grade);
}

/****************************************************************************
 * Name: touch_lh_denoise_get_grade
 *
 * Description:
 *   Get denoise range of denoise channel.
 *   Determined by measuring the noise amplitude of the denoise channel.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_denoise_grade_e value.
 *
 ****************************************************************************/

static inline enum touch_denoise_grade_e touch_lh_denoise_get_grade(void)
{
  return (enum touch_denoise_grade_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                  RTC_CNTL_TOUCH_DENOISE_RES);
}

/****************************************************************************
 * Name: touch_lh_denoise_read_data
 *
 * Description:
 *   Read denoise measure value (TOUCH_PAD_NUM0).
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current denoise value.
 *
 ****************************************************************************/

