apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_touch_lowerhalf.h
static inline uint32_t touch_lh_denoise_read_data(void)
{
  return REG_GET_FIELD(SENS_SAR_TOUCH_DENOISE_REG, SENS_TOUCH_DENOISE_DATA);
}

/****************************************************************************
 * Name: touch_lh_waterproof_set_guard_pad
 *
 * Description:
 *   Set touch channel used for guard pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_waterproof_set_guard_pad(enum touch_pad_e tp)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                RTC_CNTL_TOUCH_OUT_RING,
                tp);
}

/****************************************************************************
 * Name: touch_lh_waterproof_get_guard_pad
 *
 * Description:
 *   Get touch channel used for guard pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_pad_e channel.
 *
 ****************************************************************************/

static inline enum touch_pad_e touch_lh_waterproof_get_guard_pad(void)
{
  return (enum touch_pad_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG, RTC_CNTL_TOUCH_OUT_RING);
}

/****************************************************************************
 * Name: touch_lh_waterproof_set_sheild_driver
 *
 * Description:
 *   Set max equivalent capacitance for shield channel.
 *   The equivalent capacitance of the shielded channel can be calculated
 *   from the reading of denoise channel.
 *
 * Input Parameters:
 *   level - The desired enum touch_shield_driver_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void
  touch_lh_waterproof_set_sheild_driver(enum touch_shield_driver_e level)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                RTC_CNTL_TOUCH_BUFDRV,
                level);
}

/****************************************************************************
 * Name: touch_lh_waterproof_get_sheild_driver
 *
 * Description:
 *   Set max equivalent capacitance for shield channel.
 *   The equivalent capacitance of the shielded channel can be calculated
 *   from the reading of denoise channel.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_shield_driver_e value.
 *
 ****************************************************************************/

static inline enum touch_shield_driver_e
  touch_lh_waterproof_get_sheild_driver(void)
{
  return (enum touch_shield_driver_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG, RTC_CNTL_TOUCH_BUFDRV);
}

/****************************************************************************
 * Name: touch_lh_waterproof_enable
 *
 * Description:
 *   Enable parameter of waterproof function.
 *   The waterproof function includes a shielded channel (TOUCH_PAD_NUM14)
 *   and a guard channel.
 *   Guard pad is used to detect the large area of water covering the touch
 *   panel.
 *   Shield pad is used to shield the influence of water droplets covering
 *   the touch panel.
 *   It is generally designed as a grid and is placed around the touch
 *   buttons.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_waterproof_enable(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                RTC_CNTL_TOUCH_SHIELD_PAD_EN,
                true);
}

/****************************************************************************
 * Name: touch_lh_waterproof_disable
 *
 * Description:
 *   Disable parameter of waterproof function.
 *   The waterproof function includes a shielded channel (TOUCH_PAD_NUM14)
 *   and a guard channel.
 *   Guard pad is used to detect the large area of water covering the touch
 *   panel.
 *   Shield pad is used to shield the influence of water droplets covering
 *   the touch panel.
 *   It is generally designed as a grid and is placed around the touch
 *   buttons.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_waterproof_disable(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                RTC_CNTL_TOUCH_SHIELD_PAD_EN,
                false);
}

/****************************************************************************
 * Name: touch_lh_proximity_set_channel_num
 *
 * Description:
 *   Set touch channel number for proximity pad.
 *   If disable the proximity pad, point this pad to TOUCH_PAD_NUM0
 *
 * Input Parameters:
 *   prox_pad - The array of three proximity pads.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void
  touch_lh_proximity_set_channel_num(const enum touch_pad_e prox_pad[])
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_APPROACH_PAD0,
                prox_pad[0]);

  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_APPROACH_PAD1,
                prox_pad[1]);

  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_APPROACH_PAD2,
                prox_pad[2]);
}

/****************************************************************************
 * Name: touch_lh_proximity_get_channel_num
 *
 * Description:
 *   Get touch channel number for proximity pad.
 *   If disable the proximity pad, point this pad to TOUCH_PAD_NUM0
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The array of three proximity pads through prox_pad.
 *
 ****************************************************************************/

static inline void
  touch_lh_proximity_get_channel_num(enum touch_pad_e prox_pad[])
{
  prox_pad[0] = REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                              SENS_TOUCH_APPROACH_PAD0);

  prox_pad[1] = REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                              SENS_TOUCH_APPROACH_PAD1);

